social_net/perf_testing/data/composePost/202404261331_600_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 222.575ms, rate sampling interval: 818ms
  Thread calibration: mean lat.: 210.788ms, rate sampling interval: 796ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.38s     2.75s    9.87s    84.47%
    Req/Sec   178.24     29.87   269.00     81.63%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  110.21ms
 75.000%  338.17ms
 90.000%    6.73s 
 99.000%    9.87s 
 99.900%   10.39s 
 99.990%   10.63s 
 99.999%   10.66s 
100.000%   10.66s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      13.583     0.000000            1         1.00
      87.807     0.100000          715         1.11
      92.671     0.200000         1435         1.25
      96.511     0.300000         2151         1.43
     101.055     0.400000         2855         1.67
     110.207     0.500000         3569         2.00
     123.071     0.550000         3926         2.22
     138.495     0.600000         4283         2.50
     162.175     0.650000         4637         2.86
     207.871     0.700000         4994         3.33
     338.175     0.750000         5352         4.00
     429.567     0.775000         5529         4.44
     602.623     0.800000         5707         5.00
    2820.095     0.825000         5885         5.71
    4440.063     0.850000         6064         6.67
    5636.095     0.875000         6242         8.00
    6152.191     0.887500         6331         8.89
    6725.631     0.900000         6421        10.00
    7262.207     0.912500         6509        11.43
    7815.167     0.925000         6599        13.33
    8282.111     0.937500         6688        16.00
    8470.527     0.943750         6733        17.78
    8634.367     0.950000         6777        20.00
    8830.975     0.956250         6821        22.86
    9027.583     0.962500         6870        26.67
    9183.231     0.968750         6913        32.00
    9265.151     0.971875         6934        35.56
    9347.071     0.975000         6956        40.00
    9453.567     0.978125         6979        45.71
    9560.063     0.981250         7001        53.33
    9674.751     0.984375         7022        64.00
    9723.903     0.985938         7034        71.11
    9781.247     0.987500         7044        80.00
    9846.783     0.989062         7056        91.43
    9895.935     0.990625         7067       106.67
    9953.279     0.992188         7079       128.00
    9977.855     0.992969         7084       142.22
   10018.815     0.993750         7095       160.00
   10018.815     0.994531         7095       182.86
   10027.007     0.995313         7100       213.33
   10067.967     0.996094         7106       256.00
   10076.159     0.996484         7108       284.44
   10117.119     0.996875         7112       320.00
   10133.503     0.997266         7114       365.71
   10182.655     0.997656         7117       426.67
   10231.807     0.998047         7120       512.00
   10256.383     0.998242         7121       568.89
   10272.767     0.998437         7122       640.00
   10330.111     0.998633         7124       731.43
   10354.687     0.998828         7125       853.33
   10428.415     0.999023         7127      1024.00
   10428.415     0.999121         7127      1137.78
   10452.991     0.999219         7128      1280.00
   10510.335     0.999316         7130      1462.86
   10510.335     0.999414         7130      1706.67
   10510.335     0.999512         7130      2048.00
   10510.335     0.999561         7130      2275.56
   10584.063     0.999609         7131      2560.00
   10584.063     0.999658         7131      2925.71
   10584.063     0.999707         7131      3413.33
   10633.215     0.999756         7132      4096.00
   10633.215     0.999780         7132      4551.11
   10633.215     0.999805         7132      5120.00
   10633.215     0.999829         7132      5851.43
   10633.215     0.999854         7132      6826.67
   10657.791     0.999878         7133      8192.00
   10657.791     1.000000         7133          inf
#[Mean    =     1382.294, StdDeviation   =     2754.173]
#[Max     =    10649.600, Total count    =         7133]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  11026 requests in 30.03s, 2.98MB read
  Non-2xx or 3xx responses: 77
Requests/sec:    367.21  
Transfer/sec:    101.77KB