social_net/perf_testing/data/composePost/202404261334_900_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 407.204ms, rate sampling interval: 2152ms
  Thread calibration: mean lat.: 386.358ms, rate sampling interval: 2038ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.75s     3.21s   10.85s    87.49%
    Req/Sec   326.78     35.67   374.00     55.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  460.29ms
 75.000%    1.25s 
 90.000%    8.85s 
 99.000%   10.85s 
 99.900%   19.79s 
 99.990%   21.05s 
 99.999%   21.14s 
100.000%   21.14s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      14.151     0.000000            1         1.00
      99.263     0.100000         1303         1.11
     138.239     0.200000         2594         1.25
     204.415     0.300000         3890         1.43
     303.103     0.400000         5189         1.67
     460.287     0.500000         6483         2.00
     615.423     0.550000         7133         2.22
     818.175     0.600000         7780         2.50
     986.111     0.650000         8430         2.86
    1128.447     0.700000         9077         3.33
    1254.399     0.750000         9732         4.00
    1312.767     0.775000        10049         4.44
    1387.519     0.800000        10374         5.00
    1471.487     0.825000        10697         5.71
    1592.319     0.850000        11022         6.67
    7475.199     0.875000        11346         8.00
    8478.719     0.887500        11509         8.89
    8855.551     0.900000        11670        10.00
    9215.999     0.912500        11834        11.43
    9527.295     0.925000        11994        13.33
    9773.055     0.937500        12159        16.00
    9920.511     0.943750        12241        17.78
   10002.431     0.950000        12328        20.00
   10067.967     0.956250        12406        22.86
   10174.463     0.962500        12482        26.67
   10289.151     0.968750        12562        32.00
   10354.687     0.971875        12603        35.56
   10420.223     0.975000        12642        40.00
   10493.951     0.978125        12687        45.71
   10559.487     0.981250        12725        53.33
   10665.983     0.984375        12764        64.00
   10715.135     0.985938        12788        71.11
   10747.903     0.987500        12805        80.00
   10821.631     0.989062        12825        91.43
   10878.975     0.990625        12848       106.67
   10952.703     0.992188        12865       128.00
   11100.159     0.992969        12876       142.22
   11165.695     0.993750        12886       160.00
   11223.039     0.994531        12896       182.86
   11313.151     0.995313        12906       213.33
   19169.279     0.996094        12917       256.00
   19202.047     0.996484        12921       284.44
   19251.199     0.996875        12928       320.00
   19283.967     0.997266        12931       365.71
   19398.655     0.997656        12936       426.67
   19496.959     0.998047        12941       512.00
   19578.879     0.998242        12944       568.89
   19628.031     0.998437        12946       640.00
   19709.951     0.998633        12949       731.43
   19775.487     0.998828        12952       853.33
   19791.871     0.999023        12955      1024.00
   19791.871     0.999121        12955      1137.78
   19824.639     0.999219        12959      1280.00
   19824.639     0.999316        12959      1462.86
   19824.639     0.999414        12959      1706.67
   19841.023     0.999512        12960      2048.00
   19857.407     0.999561        12961      2275.56
   19857.407     0.999609        12961      2560.00
   19873.791     0.999658        12962      2925.71
   19890.175     0.999707        12963      3413.33
   19890.175     0.999756        12963      4096.00
   19906.559     0.999780        12964      4551.11
   19906.559     0.999805        12964      5120.00
   19906.559     0.999829        12964      5851.43
   21053.439     0.999854        12965      6826.67
   21053.439     0.999878        12965      8192.00
   21053.439     0.999890        12965      9102.22
   21053.439     0.999902        12965     10240.00
   21053.439     0.999915        12965     11702.86
   21135.359     0.999927        12966     13653.33
   21135.359     1.000000        12966          inf
#[Mean    =     1748.352, StdDeviation   =     3211.628]
#[Max     =    21118.976, Total count    =        12966]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  19114 requests in 30.00s, 5.17MB read
  Non-2xx or 3xx responses: 70
Requests/sec:    637.10  
Transfer/sec:    176.40KB