social_net/perf_testing/data/composePost/202404261531_1450_2m.txt
Running 2m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 2452.928ms, rate sampling interval: 8732ms
  Thread calibration: mean lat.: 2474.202ms, rate sampling interval: 8765ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    30.09s    16.09s    1.06m    60.76%
    Req/Sec   391.58     59.01   480.00     70.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   28.21s 
 75.000%   43.91s 
 90.000%    0.86m 
 99.000%    1.06m 
 99.900%    1.20m 
 99.990%    1.24m 
 99.999%    1.24m 
100.000%    1.24m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4231.167     0.000000            1         1.00
    9068.543     0.100000         8645         1.11
   14295.039     0.200000        17284         1.25
   18644.991     0.300000        25944         1.43
   23216.127     0.400000        34582         1.67
   28213.247     0.500000        43201         2.00
   30998.527     0.550000        47533         2.22
   34701.311     0.600000        51842         2.50
   38273.023     0.650000        56206         2.86
   40992.767     0.700000        60487         3.33
   43909.119     0.750000        64808         4.00
   44924.927     0.775000        66992         4.44
   46104.575     0.800000        69143         5.00
   47448.063     0.825000        71303         5.71
   49020.927     0.850000        73492         6.67
   50266.111     0.875000        75608         8.00
   50888.703     0.887500        76679         8.89
   51773.439     0.900000        77773        10.00
   52789.247     0.912500        78846        11.43
   54034.431     0.925000        79947        13.33
   55410.687     0.937500        81006        16.00
   56066.047     0.943750        81544        17.78
   56623.103     0.950000        82101        20.00
   57278.463     0.956250        82639        22.86
   58163.199     0.962500        83165        26.67
   59244.543     0.968750        83701        32.00
   59998.207     0.971875        83978        35.56
   60653.567     0.975000        84248        40.00
   61210.623     0.978125        84521        45.71
   61734.911     0.981250        84777        53.33
   62390.271     0.984375        85058        64.00
   62685.183     0.985938        85182        71.11
   63078.399     0.987500        85329        80.00
   63406.079     0.989062        85452        91.43
   63930.367     0.990625        85589       106.67
   64552.959     0.992188        85722       128.00
   65503.231     0.992969        85787       142.22
   67633.151     0.993750        85858       160.00
   67960.831     0.994531        85925       182.86
   68485.119     0.995313        85998       213.33
   68943.871     0.996094        86071       256.00
   69140.479     0.996484        86095       284.44
   69402.623     0.996875        86133       320.00
   69664.767     0.997266        86162       365.71
   69926.911     0.997656        86200       426.67
   70189.055     0.998047        86229       512.00
   70385.663     0.998242        86249       568.89
   70909.951     0.998437        86260       640.00
   71172.095     0.998633        86282       731.43
   71630.847     0.998828        86294       853.33
   71958.527     0.999023        86312      1024.00
   72155.135     0.999121        86319      1137.78
   72351.743     0.999219        86328      1280.00
   72548.351     0.999316        86336      1462.86
   72679.423     0.999414        86344      1706.67
   73007.103     0.999512        86354      2048.00
   73138.175     0.999561        86358      2275.56
   73334.783     0.999609        86363      2560.00
   73400.319     0.999658        86365      2925.71
   73465.855     0.999707        86372      3413.33
   73531.391     0.999756        86374      4096.00
   73596.927     0.999780        86376      4551.11
   73727.999     0.999805        86379      5120.00
   73793.535     0.999829        86381      5851.43
   73924.607     0.999854        86382      6826.67
   74055.679     0.999878        86384      8192.00
   74121.215     0.999890        86385      9102.22
   74252.287     0.999902        86387     10240.00
   74252.287     0.999915        86387     11702.86
   74317.823     0.999927        86388     13653.33
   74383.359     0.999939        86392     16384.00
   74383.359     0.999945        86392     18204.44
   74383.359     0.999951        86392     20480.00
   74383.359     0.999957        86392     23405.71
   74383.359     0.999963        86392     27306.67
   74383.359     0.999969        86392     32768.00
   74383.359     0.999973        86392     36408.89
   74383.359     0.999976        86392     40960.00
   74448.895     0.999979        86394     46811.43
   74448.895     1.000000        86394          inf
#[Mean    =    30093.654, StdDeviation   =    16090.143]
#[Max     =    74383.360, Total count    =        86394]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  93559 requests in 2.00m, 25.31MB read
  Non-2xx or 3xx responses: 334
Requests/sec:    779.65  
Transfer/sec:    215.99KB